# Terraform `environment` `test`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.test-pgsql-vnet.azurerm_subnet.postgresql_subnets["0"] will be created
  + resource "azurerm_subnet" "postgresql_subnets" {
      + address_prefixes                              = [
          + "10.100.10.0/28",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "test-pgsql-vnet-subnet-0"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "DIS_admin-test_main-rg"
      + service_endpoints                             = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "test-pgsql-vnet"

      + delegation {
          + name = "postgresql-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # module.test-pgsql-vnet.azurerm_subnet.postgresql_subnets["1"] will be created
  + resource "azurerm_subnet" "postgresql_subnets" {
      + address_prefixes                              = [
          + "10.100.10.16/28",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "test-pgsql-vnet-subnet-1"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "DIS_admin-test_main-rg"
      + service_endpoints                             = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "test-pgsql-vnet"

      + delegation {
          + name = "postgresql-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # module.test-pgsql-vnet.azurerm_subnet.postgresql_subnets["10"] will be created
  + resource "azurerm_subnet" "postgresql_subnets" {
      + address_prefixes                              = [
          + "10.100.10.160/28",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "test-pgsql-vnet-subnet-10"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "DIS_admin-test_main-rg"
      + service_endpoints                             = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "test-pgsql-vnet"

      + delegation {
          + name = "postgresql-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # module.test-pgsql-vnet.azurerm_subnet.postgresql_subnets["11"] will be created
  + resource "azurerm_subnet" "postgresql_subnets" {
      + address_prefixes                              = [
          + "10.100.10.176/28",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "test-pgsql-vnet-subnet-11"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "DIS_admin-test_main-rg"
      + service_endpoints                             = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "test-pgsql-vnet"

      + delegation {
          + name = "postgresql-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # module.test-pgsql-vnet.azurerm_subnet.postgresql_subnets["12"] will be created
  + resource "azurerm_subnet" "postgresql_subnets" {
      + address_prefixes                              = [
          + "10.100.10.192/28",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "test-pgsql-vnet-subnet-12"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "DIS_admin-test_main-rg"
      + service_endpoints                             = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "test-pgsql-vnet"

      + delegation {
          + name = "postgresql-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # module.test-pgsql-vnet.azurerm_subnet.postgresql_subnets["13"] will be created
  + resource "azurerm_subnet" "postgresql_subnets" {
      + address_prefixes                              = [
          + "10.100.10.208/28",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "test-pgsql-vnet-subnet-13"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "DIS_admin-test_main-rg"
      + service_endpoints                             = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "test-pgsql-vnet"

      + delegation {
          + name = "postgresql-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # module.test-pgsql-vnet.azurerm_subnet.postgresql_subnets["14"] will be created
  + resource "azurerm_subnet" "postgresql_subnets" {
      + address_prefixes                              = [
          + "10.100.10.224/28",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "test-pgsql-vnet-subnet-14"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "DIS_admin-test_main-rg"
      + service_endpoints                             = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "test-pgsql-vnet"

      + delegation {
          + name = "postgresql-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # module.test-pgsql-vnet.azurerm_subnet.postgresql_subnets["15"] will be created
  + resource "azurerm_subnet" "postgresql_subnets" {
      + address_prefixes                              = [
          + "10.100.10.240/28",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "test-pgsql-vnet-subnet-15"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "DIS_admin-test_main-rg"
      + service_endpoints                             = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "test-pgsql-vnet"

      + delegation {
          + name = "postgresql-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # module.test-pgsql-vnet.azurerm_subnet.postgresql_subnets["2"] will be created
  + resource "azurerm_subnet" "postgresql_subnets" {
      + address_prefixes                              = [
          + "10.100.10.32/28",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "test-pgsql-vnet-subnet-2"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "DIS_admin-test_main-rg"
      + service_endpoints                             = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "test-pgsql-vnet"

      + delegation {
          + name = "postgresql-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # module.test-pgsql-vnet.azurerm_subnet.postgresql_subnets["3"] will be created
  + resource "azurerm_subnet" "postgresql_subnets" {
      + address_prefixes                              = [
          + "10.100.10.48/28",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "test-pgsql-vnet-subnet-3"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "DIS_admin-test_main-rg"
      + service_endpoints                             = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "test-pgsql-vnet"

      + delegation {
          + name = "postgresql-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # module.test-pgsql-vnet.azurerm_subnet.postgresql_subnets["4"] will be created
  + resource "azurerm_subnet" "postgresql_subnets" {
      + address_prefixes                              = [
          + "10.100.10.64/28",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "test-pgsql-vnet-subnet-4"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "DIS_admin-test_main-rg"
      + service_endpoints                             = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "test-pgsql-vnet"

      + delegation {
          + name = "postgresql-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # module.test-pgsql-vnet.azurerm_subnet.postgresql_subnets["5"] will be created
  + resource "azurerm_subnet" "postgresql_subnets" {
      + address_prefixes                              = [
          + "10.100.10.80/28",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "test-pgsql-vnet-subnet-5"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "DIS_admin-test_main-rg"
      + service_endpoints                             = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "test-pgsql-vnet"

      + delegation {
          + name = "postgresql-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # module.test-pgsql-vnet.azurerm_subnet.postgresql_subnets["6"] will be created
  + resource "azurerm_subnet" "postgresql_subnets" {
      + address_prefixes                              = [
          + "10.100.10.96/28",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "test-pgsql-vnet-subnet-6"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "DIS_admin-test_main-rg"
      + service_endpoints                             = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "test-pgsql-vnet"

      + delegation {
          + name = "postgresql-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # module.test-pgsql-vnet.azurerm_subnet.postgresql_subnets["7"] will be created
  + resource "azurerm_subnet" "postgresql_subnets" {
      + address_prefixes                              = [
          + "10.100.10.112/28",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "test-pgsql-vnet-subnet-7"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "DIS_admin-test_main-rg"
      + service_endpoints                             = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "test-pgsql-vnet"

      + delegation {
          + name = "postgresql-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # module.test-pgsql-vnet.azurerm_subnet.postgresql_subnets["8"] will be created
  + resource "azurerm_subnet" "postgresql_subnets" {
      + address_prefixes                              = [
          + "10.100.10.128/28",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "test-pgsql-vnet-subnet-8"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "DIS_admin-test_main-rg"
      + service_endpoints                             = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "test-pgsql-vnet"

      + delegation {
          + name = "postgresql-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # module.test-pgsql-vnet.azurerm_subnet.postgresql_subnets["9"] will be created
  + resource "azurerm_subnet" "postgresql_subnets" {
      + address_prefixes                              = [
          + "10.100.10.144/28",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "test-pgsql-vnet-subnet-9"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "DIS_admin-test_main-rg"
      + service_endpoints                             = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "test-pgsql-vnet"

      + delegation {
          + name = "postgresql-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # module.test-pgsql-vnet.azurerm_virtual_network.postgresql will be created
  + resource "azurerm_virtual_network" "postgresql" {
      + address_space                  = [
          + "10.100.10.0/24",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "norwayeast"
      + name                           = "test-pgsql-vnet"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "DIS_admin-test_main-rg"
      + subnet                         = (known after apply)
    }

  # module.test-pgsql-vnet.azurerm_virtual_network_peering.peered_vnet_to_postgresql will be created
  + resource "azurerm_virtual_network_peering" "peered_vnet_to_postgresql" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "admin-test-vnet-to-test-pgsql-vnet"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "admin-test-rg"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "admin-test-vnet"
    }

  # module.test-pgsql-vnet.azurerm_virtual_network_peering.postgresql_to_peered_vnet will be created
  + resource "azurerm_virtual_network_peering" "postgresql_to_peered_vnet" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "test-pgsql-vnet-to-admin-test-vnet"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.Network/virtualNetworks/admin-test-vnet"
      + resource_group_name                    = "DIS_admin-test_main-rg"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "test-pgsql-vnet"
    }

Plan: 19 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @tjololo |
| Action | `push` |
| Working Directory | `./infrastructure/adminservices-test/admin-test-aks-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/admin-test-aks-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_admin-test-aks-rg.tfstate.tfplan` |